#------------------------------------------------------------------------------------
print('\n','Программа, которая удаляет из списка все элементы, стоящие на четных позициях.')
import task_a
#------------------------------------------------------------------------------------
print('Программа, которая считывает список слов и находит слова, содержащие более трех гласных букв.')
import task_b
#------------------------------------------------------------------------------------
print('Программа, которая находит второй по величине элемент в списке.')
import task_c
#------------------------------------------------------------------------------------
print('Программа, которая удаляет из списка все дубликаты.')
import task_d
#------------------------------------------------------------------------------------
print('Программа, которая считывает данные из CSV-файла и создает словарь, где ключами являются значения в столбце «Name», а значениями — соответствующие им словари с информацией о поле, возрасте и зарплате.')
import task_e
#------------------------------------------------------------------------------------
print('Программа, которая запрашивает у пользователя строку и выводит на экран все ее подстроки длиной не менее трех символов.')
import task_f
#------------------------------------------------------------------------------------