#------------------------------------------------------------------------------------
# Функция, выводящая подстроки длиной не менее трех символов
def print_substrings(string):
    length = len(string)
    for x in range(length):
        for y in range(x + 3, length + 1):
            substring = string[x:y]
            print(substring)
#------------------------------------------------------------------------------------
# Ввод/вывод
user_input = input("Введите строку: ")
print("Подстроки длиной не менее трех символов:",'\n',print_substrings(user_input))
#------------------------------------------------------------------------------------