#------------------------------------------------------------------------------------
# Функция, которая удаляет из списка все дубликаты.
def remove_duplicates(list):
    viewed = set()
    result = []
    for word in list:
        if word not in viewed:
            viewed.add(word)
            result.append(word)
    return result
#------------------------------------------------------------------------------------
# Ввод/вывод
my_list = input('Введите элементы списка: ').split()
print('Ваш список без дупликатов: ',remove_duplicates(my_list),'\n')
#------------------------------------------------------------------------------------