#------------------------------------------------------------------------------------
# Функция, удаляющая элементы, стоящие на четных позициях
def odd_positions(list):
    list=list.split()
    return [list[i] for i in range(len(list)) if i % 2 == 0]
#------------------------------------------------------------------------------------
# Ввод/вывод
list=input('Введите элементы списка через пробел: ')
print('Список без элементов, стоящих на четных позициях',odd_positions(list),'\n')
#------------------------------------------------------------------------------------